# NOTEBOOK 1 - Consistency Check of ORDERS, PRODUCTS, ORDERS_PRODUCTS_PRIOR and Merge of ORDERS with ORDERS_PRODUCTS_PRIOR

DATASETS:
- ORDERS - original dataset with 3.421.083 rows and 7 columns
- ORDERS_PRODUCTS_PRIOR - original dataset with 32.434.489 rows and 4 columns
- PRODUCTS - original dataset with 49.693 rows and 5 columns

CONTENTS:
1. Consitency check of the ORDERS dataset
a. Dropping columns
b. Renaming columns
c. Missing values
d. Data types
e. Duplicates
    
2. Consistency check of the PRODUCTS dataset
a. Missing values
b. Data types
c. Duplicates
    
3. Consistency check of ORDERS_PRODUCTS_PRIOR dataset
a. Missing values
b. Data types
c. Duplicates
    
4. Merging ORDERS with ORDERS_PRODUCTS_PRIOR

In [2]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 1. Consistency check of ORDERS dataset = df_ORDS

In [3]:
# Import original "orders.csv" dataset

df_ORDS = pd.read_csv(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Original Data\orders.csv')

In [4]:
# Check the numbers of rows and columns

df_ORDS.shape

(3421083, 7)

In [5]:
df_ORDS.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [6]:
df_ORDS.tail()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [7]:
df_ORDS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   order_dow               int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
dtypes: float64(1), int64(5), object(1)
memory usage: 182.7+ MB

    1.a. Dropping columns

In [8]:
# Drop the "eval_set" column as it has no use for the analysis

df_ORDS.drop(columns = ['eval_set'], inplace = True)

    1.b. Renaming columns

In [9]:
# Rename column "order_dow" to give more intuitive meaning

df_ORDS.rename(columns = {'order_dow' : 'order_day_of_the_week'}, inplace = True)

In [10]:
# Check the two changes

df_ORDS.head()

,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

    1.c. Missing values

In [11]:
# Missing values using "isnull" function

df_ORDS.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_day_of_the_week          0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [13]:
# Look for missing values in the "days_since_prior_order"

df_ORDS['days_since_prior_order'].value_counts(dropna = False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

    1.d Data types

In [14]:
# Check data types

df_ORDS.dtypes

order_id                    int64
user_id                     int64
order_number                int64
order_day_of_the_week       int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [15]:
# Look for mixed-data types

for col in df_ORDS.columns.tolist():
  weird = (df_ORDS[[col]].applymap(type) != df_ORDS[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ORDS[weird]) > 0:
    print (col)

In [16]:
# Change "order_id" from integer into string

df_ORDS['order_id'] = df_ORDS['order_id'].astype('str')

In [17]:
df_ORDS['order_id'].dtype

dtype('O')

In [18]:
# Change "user_id" data type

df_ORDS['user_id'] = df_ORDS['user_id'].astype('str')

In [19]:
df_ORDS['user_id'].dtype

dtype('O')

In [20]:
# String types data are excluded from the summary stats

df_ORDS.describe()

,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

    1.e. Duplicates

In [21]:
# Look for duplicates

df_ORDS_dups = df_ORDS[df_ORDS.duplicated()]

# No duplicates found

In [22]:
# Export the wrangled dataset

df_ORDS.to_csv(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Prepared Data\df_ORDS_wrangled_final.csv', index=False )

# 2. Consistency check of PRODUCT dataset = df_PRODS

In [23]:
# Import the original "products.csv" dataset

df_PRODS = pd.read_csv(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Original Data\products.csv')

In [24]:
df_PRODS.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [25]:
df_PRODS.tail()

,product_id,product_name,aisle_id,department_id,prices
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [26]:
df_PRODS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int64
 3   department_id  49693 non-null  int64
 4   prices         49693 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

    2.a. Missing values

In [32]:
# Look for missing values

df_PRODS.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [33]:
# Check the "product_name" column

df_PRODS['product_name'].value_counts(dropna = False)

NaN                                      16
Adore Forever Body Wash                   2
Black House Coffee Roasty Stout Beer      2
Ranger IPA                                2
Fiber 4g Gummy Dietary Supplement         2
                                         ..
Charcoal Briquettes Mesquite              1
Dentastix® Mini Dog Chews                 1
Sugar Free Gum with Xylitol Spearmint     1
Original Thin Sausage Pizza               1
Vinegar & Sea Salt Potato Chips           1
Name: product_name, Length: 49673, dtype: int64

    2.b. Data types

In [34]:
# Change "product_id", "aisle_id", "department_id" data type into string

df_PRODS['product_id'] = df_PRODS['product_id'].astype('str')
df_PRODS['aisle_id'] = df_PRODS['aisle_id'].astype('str')
df_PRODS['department_id'] = df_PRODS['department_id'].astype('str')

In [35]:
# Check the change

df_PRODS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  object
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  object
 3   department_id  49693 non-null  object
 4   prices         49693 non-null  float64
dtypes: float64(1), object(4)
memory usage: 1.9+ MB

In [36]:
# Look for mixed-data types

for col in df_PRODS.columns.tolist():
  weird = (df_PRODS[[col]].applymap(type) != df_PRODS[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_PRODS[weird]) > 0:
    print (col)
    
# The result shows "product_name" column because it contains 16 empty cells NaN

product_name

In [37]:
# Delete 16 rows with missing values in the "product_name" columns

df_PRODS_clean = df_PRODS[df_PRODS['product_name'].isnull() == False]

In [38]:
df_PRODS_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49677 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49677 non-null  object
 1   product_name   49677 non-null  object
 2   aisle_id       49677 non-null  object
 3   department_id  49677 non-null  object
 4   prices         49677 non-null  float64
dtypes: float64(1), object(4)
memory usage: 2.3+ MB

In [40]:
df_PRODS_clean.describe()

             prices
count  49677.000000
mean       9.993164
std      453.592708
min        1.000000
25%        4.100000
50%        7.100000
75%       11.100000
max    99999.000000

2.c. Duplicates

In [41]:
# Look for duplicates

df_PRODS_dups = df_PRODS_clean[df_PRODS_clean.duplicated()]

# No duplicates found

In [42]:
# Export the wrangled dataset

df_PRODS_clean.to_csv(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Prepared Data\df_PRODS_wrangled_final.csv', index=False )

# 3. Consistency check of ORDERS_PRODUCTS_PRIOR
This data set contains data from the past and need to be merged with "orders" set to inclued "product_id" in the "orders" set

In [43]:
# Import the original dataset

df_ORDS_PRODS_prior = pd.read_csv(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Original Data\order_products__prior.csv')

In [47]:
df_ORDS_PRODS_prior.head()

  order_id product_id  add_to_cart_order  reordered
0        2      33120                  1          1
1        2      28985                  2          1
2        2       9327                  3          0
3        2      45918                  4          1
4        2      30035                  5          0

In [48]:
df_ORDS_PRODS_prior.tail()

         order_id product_id  add_to_cart_order  reordered
32434484  3421083      39678                  6          1
32434485  3421083      11352                  7          0
32434486  3421083       4600                  8          0
32434487  3421083      24852                  9          1
32434488  3421083       5020                 10          1

In [49]:
df_ORDS_PRODS_prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           object
 1   product_id         object
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(2), object(2)
memory usage: 989.8+ MB

    3.a. Missing values

In [50]:
df_ORDS_PRODS_prior.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

    3.b. Data types

In [51]:
for col in df_ORDS_PRODS_prior.columns.tolist():
  weird = (df_ORDS_PRODS_prior[[col]].applymap(type) != df_ORDS_PRODS_prior[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ORDS_PRODS_prior[weird]) > 0:
    print (col)

In [52]:
# Change "product_id", "aisle_id", "department_id" data type

df_ORDS_PRODS_prior['product_id'] = df_ORDS_PRODS_prior['product_id'].astype('str')
df_ORDS_PRODS_prior['order_id'] = df_ORDS_PRODS_prior['order_id'].astype('str')

    3.c. Duplicates

In [53]:
df_ORDS_PRODS_prior_dups = df_ORDS_PRODS_prior[df_ORDS_PRODS_prior.duplicated()]

# 4. Merging ORDERS with ORDERS_PRODUCTS_PRIOR
The merge will be performed on "order_id" variable; data type has been unified in both datasets to string

In [54]:
df_ORDS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int64
 3   order_day_of_the_week   int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 156.6+ MB

In [55]:
df_ORDS_PRODS_prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           object
 1   product_id         object
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(2), object(2)
memory usage: 989.8+ MB

In [ ]:
# merging the two data sets on column "order_id"
# the order set has  3.421.083 rows
# the prior set has 32.434.489 rows

In [56]:
# The output below shows the frequency of a merge using the argument how = outer. 
# Merging like this will combine all the observations and show the real merge rate:

df_ORDS_large = df_ORDS.merge(df_ORDS_PRODS_prior, on = 'order_id', how = 'outer', indicator = True)

In [57]:
df_ORDS_large.info()

# the merged dataset contains 32.640.698 rows and 10 columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32640698 entries, 0 to 32640697
Data columns (total 10 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int64
 3   order_day_of_the_week   int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              object
 7   add_to_cart_order       float64
 8   reordered               float64
 9   _merge                  category
dtypes: category(1), float64(3), int64(3), object(3)
memory usage: 2.5+ GB

In [58]:
df_ORDS_large.head()

,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1.0,0.0,both
1,2539329,1,1,2,8,NaN,14084,2.0,0.0,both
2,2539329,1,1,2,8,NaN,12427,3.0,0.0,both
3,2539329,1,1,2,8,NaN,26088,4.0,0.0,both
4,2539329,1,1,2,8,NaN,26405,5.0,0.0,both

In [60]:
df_ORDS_large['_merge'].value_counts()

both          32434489
left_only       206209
right_only           0
Name: _merge, dtype: int64

In [61]:
# Drop the "_merge" column as it will prevent me from using the indicator during next merge

df_ORDS_large.drop(columns = ['_merge'], inplace = True)

In [63]:
df_ORDS_large.to_csv(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Prepared Data\df_ORDS_large_wrangled_final.csv', index=False)

df_ORDS_large.to_pickle(r'D:\CareerFoundry\Data Immersion\Task 4\Instacart Basket Analysis_2021-07-22\02 Data\Prepared Data\df_ORDS_large_wrangled_final.pkl')

# For continuation refer to notebook 2_Final_Instacart